In [1]:
import pandas as pd

df = pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],
                  'data':[0,5,10,5,10,15,10,15,20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [2]:
for key in ['A','B','C']:
    print (key,df[df['key'] == key].sum())

A key     AAA
data     15
dtype: object
B key     BBB
data     30
dtype: object
C key     CCC
data     45
dtype: object

In [3]:
df.groupby('key').sum()

     data
key
A      15
B      30
C      45

In [6]:
import numpy as np
df.groupby('key').aggregate(np.mean)

     data
key
A       5
B      10
C      15

In [7]:
df = pd.read_csv('./data/titanic.csv')

In [8]:
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [10]:
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64